zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
#define BTU2_REG_BTU_RIF_BTC_DBUS_RSSI_DBUS_RSSI_ENABLE_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_BTC_DBUS_RSSI_DBUS_RSSI_ENABLE_SHIFT (15U)
/*! DBus_RSSI_Enable - Enable Automatic Reading of RSSI on the dBus
 *  0b0..disable automatic reading of RSSI
 *  0b1..enable automatic reading of RSSI
 */
#define BTU2_REG_BTU_RIF_BTC_DBUS_RSSI_DBUS_RSSI_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BTC_DBUS_RSSI_DBUS_RSSI_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_BTC_DBUS_RSSI_DBUS_RSSI_ENABLE_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_TX_FSYN - RIF Tx dBus Fsyn */
/*! @{ */

#define BTU2_REG_BTU_RIF_DBUS_TX_FSYN_DBUS_TX_FSYN_DELAY_MASK (0x7FFU)
#define BTU2_REG_BTU_RIF_DBUS_TX_FSYN_DBUS_TX_FSYN_DELAY_SHIFT (0U)
/*! DBus_Tx_Fsyn_Delay - Tx dBus Fsyn Delay */
#define BTU2_REG_BTU_RIF_DBUS_TX_FSYN_DBUS_TX_FSYN_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_TX_FSYN_DBUS_TX_FSYN_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_TX_FSYN_DBUS_TX_FSYN_DELAY_MASK)

#define BTU2_REG_BTU_RIF_DBUS_TX_FSYN_DBUS_TX_FSYN_WR_ENABLE_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_DBUS_TX_FSYN_DBUS_TX_FSYN_WR_ENABLE_SHIFT (15U)
/*! DBus_Tx_Fsyn_Wr_Enable - Tx dBus Fsyn Enable
 *  0b0..disable automatic sending of fsync info
 *  0b1..enable automatic sending of fsync info
 */
#define BTU2_REG_BTU_RIF_DBUS_TX_FSYN_DBUS_TX_FSYN_WR_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_TX_FSYN_DBUS_TX_FSYN_WR_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_TX_FSYN_DBUS_TX_FSYN_WR_ENABLE_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_RX_FSYN - RIF Rx dBus Fsyn */
/*! @{ */

#define BTU2_REG_BTU_RIF_DBUS_RX_FSYN_DBUS_RX_FSYN_DELAY_MASK (0x7FFU)
#define BTU2_REG_BTU_RIF_DBUS_RX_FSYN_DBUS_RX_FSYN_DELAY_SHIFT (0U)
/*! DBus_Rx_Fsyn_Delay - Rx dBus Hop Delay */
#define BTU2_REG_BTU_RIF_DBUS_RX_FSYN_DBUS_RX_FSYN_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_RX_FSYN_DBUS_RX_FSYN_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_RX_FSYN_DBUS_RX_FSYN_DELAY_MASK)

#define BTU2_REG_BTU_RIF_DBUS_RX_FSYN_DBUS_RX_FSYN_WR_ENABLE_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_DBUS_RX_FSYN_DBUS_RX_FSYN_WR_ENABLE_SHIFT (15U)
/*! DBus_Rx_Fsyn_Wr_Enable - Rx dBus Fsyn Enable
 *  0b0..disable automatic sending of fsync info
 *  0b1..enable automatic sending of fsync info
 */
#define BTU2_REG_BTU_RIF_DBUS_RX_FSYN_DBUS_RX_FSYN_WR_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_RX_FSYN_DBUS_RX_FSYN_WR_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_RX_FSYN_DBUS_RX_FSYN_WR_ENABLE_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_RX_PKT_LEN - RIF dBus Rx Packet Length */
/*! @{ */

#define BTU2_REG_BTU_RIF_DBUS_RX_PKT_LEN_DBUS_RX_CTE_LEN_ENABLE_MASK (0x4000U)
#define BTU2_REG_BTU_RIF_DBUS_RX_PKT_LEN_DBUS_RX_CTE_LEN_ENABLE_SHIFT (14U)
/*! DBus_Rx_Cte_Len_Enable - dBus Rx CTE Length Enable
 *  0b0..disable automatic dbus sending Rx packet CTE length
 *  0b1..enable automatic dbus sending Rx packet CTE length
 */
#define BTU2_REG_BTU_RIF_DBUS_RX_PKT_LEN_DBUS_RX_CTE_LEN_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_RX_PKT_LEN_DBUS_RX_CTE_LEN_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_RX_PKT_LEN_DBUS_RX_CTE_LEN_ENABLE_MASK)

#define BTU2_REG_BTU_RIF_DBUS_RX_PKT_LEN_DBUS_RX_PKT_LEN_ENABLE_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_DBUS_RX_PKT_LEN_DBUS_RX_PKT_LEN_ENABLE_SHIFT (15U)
/*! DBus_Rx_Pkt_Len_Enable - dBus Rx Packet Length Enable
 *  0b0..disable automatic dbus sending Rx packet payload length
 *  0b1..enable automatic dbus sending Rx packet payload length
 */
#define BTU2_REG_BTU_RIF_DBUS_RX_PKT_LEN_DBUS_RX_PKT_LEN_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_RX_PKT_LEN_DBUS_RX_PKT_LEN_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_RX_PKT_LEN_DBUS_RX_PKT_LEN_ENABLE_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_PULSE_RX_DELAY - RIF BLE Pulse Rx Delay */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_PULSE_RX_DELAY_BLE_PULSE_RX_DELAY_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_BLE_PULSE_RX_DELAY_BLE_PULSE_RX_DELAY_SHIFT (0U)
/*! ble_Pulse_Rx_Delay - BLE Pulse Rx Delay */
#define BTU2_REG_BTU_RIF_BLE_PULSE_RX_DELAY_BLE_PULSE_RX_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_PULSE_RX_DELAY_BLE_PULSE_RX_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_BLE_PULSE_RX_DELAY_BLE_PULSE_RX_DELAY_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_PULSE_TX_DELAY - RIF BLE Pulse Tx Delay */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_PULSE_TX_DELAY_BLE_PULSE_TX_DELAY_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_BLE_PULSE_TX_DELAY_BLE_PULSE_TX_DELAY_SHIFT (0U)
/*! ble_Pulse_Tx_Delay - BLE Pulse Tx Delay */
#define BTU2_REG_BTU_RIF_BLE_PULSE_TX_DELAY_BLE_PULSE_TX_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_PULSE_TX_DELAY_BLE_PULSE_TX_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_BLE_PULSE_TX_DELAY_BLE_PULSE_TX_DELAY_MASK)
/*! @} */

/*! @name BTU_RIF_DBUS_RX_MODE_TYPE - RIF dBus Rx Mode Type */
/*! @{ */

#define BTU2_REG_BTU_RIF_DBUS_RX_MODE_TYPE_DBUS_RX_MODE_TYPE_ENABLE_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_DBUS_RX_MODE_TYPE_DBUS_RX_MODE_TYPE_ENABLE_SHIFT (15U)
/*! DBus_Rx_Mode_Type_Enable - dBus Rx Mode Type Enable
 *  0b0..disable automatic dbus sending Rx mode type
 *  0b1..enable automatic dbus sending Rx mode type
 */
#define BTU2_REG_BTU_RIF_DBUS_RX_MODE_TYPE_DBUS_RX_MODE_TYPE_ENABLE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_DBUS_RX_MODE_TYPE_DBUS_RX_MODE_TYPE_ENABLE_SHIFT)) & BTU2_REG_BTU_RIF_DBUS_RX_MODE_TYPE_DBUS_RX_MODE_TYPE_ENABLE_MASK)
/*! @} */

/*! @name BTU_RIF_MODE_TYPE_TX_DELAY - RIF Mode Type Tx Delay */
/*! @{ */

#define BTU2_REG_BTU_RIF_MODE_TYPE_TX_DELAY_MODE_TYPE_TX_DELAY_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_MODE_TYPE_TX_DELAY_MODE_TYPE_TX_DELAY_SHIFT (0U)
/*! Mode_Type_Tx_Delay - Mode Type Tx Delay */
#define BTU2_REG_BTU_RIF_MODE_TYPE_TX_DELAY_MODE_TYPE_TX_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_MODE_TYPE_TX_DELAY_MODE_TYPE_TX_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_MODE_TYPE_TX_DELAY_MODE_TYPE_TX_DELAY_MASK)
/*! @} */

/*! @name BTU_RIF_MODE_TYPE_RX_DELAY - RIF Mode Type Rx Delay */
/*! @{ */

#define BTU2_REG_BTU_RIF_MODE_TYPE_RX_DELAY_MODE_TYPE_RX_DELAY_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_MODE_TYPE_RX_DELAY_MODE_TYPE_RX_DELAY_SHIFT (0U)
/*! Mode_Type_Rx_Delay - Mode Type Rx Delay */
#define BTU2_REG_BTU_RIF_MODE_TYPE_RX_DELAY_MODE_TYPE_RX_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_MODE_TYPE_RX_DELAY_MODE_TYPE_RX_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_MODE_TYPE_RX_DELAY_MODE_TYPE_RX_DELAY_MASK)
/*! @} */

/*! @name BTU_RIF_PKTCTL_OE_DELAY - RIF Packet Control OE Delay */
/*! @{ */

#define BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_MODETYPE_MASK (0xFU)
#define BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_MODETYPE_SHIFT (0U)
/*! Pkt_Ctl_Oe_Delay_ModeType - Packet Control OE Delay Mode Type */
#define BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_MODETYPE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_MODETYPE_SHIFT)) & BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_MODETYPE_MASK)

#define BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_PPULSE_MASK (0xF0U)
#define BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_PPULSE_SHIFT (4U)
/*! Pkt_Ctl_Oe_Delay_PPulse - Packet Control OE Delay P Pulse */
#define BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_PPULSE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_PPULSE_SHIFT)) & BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_PPULSE_MASK)

