zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
#define BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_HDRSTART_MASK (0xF00U)
#define BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_HDRSTART_SHIFT (8U)
/*! Pkt_Ctl_Oe_Delay_HdrStart - Packet Control OE Delay Header Start */
#define BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_HDRSTART(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_HDRSTART_SHIFT)) & BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_PKT_CTL_OE_DELAY_HDRSTART_MASK)

#define BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_RF_BYPASS_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_RF_BYPASS_SHIFT (15U)
/*! RF_Bypass - Radio Bypass Mode Used for Baseband to Baseband Testing */
#define BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_RF_BYPASS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_RF_BYPASS_SHIFT)) & BTU2_REG_BTU_RIF_PKTCTL_OE_DELAY_RF_BYPASS_MASK)
/*! @} */

/*! @name BTU_RIF_TXSYNC_GUARD_DELAY - RIF Tx Sync Guard Delay */
/*! @{ */

#define BTU2_REG_BTU_RIF_TXSYNC_GUARD_DELAY_TX_SYNC_GUARD_DELAY_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_TXSYNC_GUARD_DELAY_TX_SYNC_GUARD_DELAY_SHIFT (0U)
/*! Tx_Sync_Guard_Delay - Tx Sync Guard Delay */
#define BTU2_REG_BTU_RIF_TXSYNC_GUARD_DELAY_TX_SYNC_GUARD_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_TXSYNC_GUARD_DELAY_TX_SYNC_GUARD_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_TXSYNC_GUARD_DELAY_TX_SYNC_GUARD_DELAY_MASK)
/*! @} */

/*! @name BTU_RIF_RXSYNC_TIMER - RIF Rx Sync Timer */
/*! @{ */

#define BTU2_REG_BTU_RIF_RXSYNC_TIMER_RX_SYNC_TIMER_DELAY_MASK (0xFU)
#define BTU2_REG_BTU_RIF_RXSYNC_TIMER_RX_SYNC_TIMER_DELAY_SHIFT (0U)
/*! Rx_Sync_Timer_Delay - Rx Sync Timer Delay */
#define BTU2_REG_BTU_RIF_RXSYNC_TIMER_RX_SYNC_TIMER_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RXSYNC_TIMER_RX_SYNC_TIMER_DELAY_SHIFT)) & BTU2_REG_BTU_RIF_RXSYNC_TIMER_RX_SYNC_TIMER_DELAY_MASK)

#define BTU2_REG_BTU_RIF_RXSYNC_TIMER_RX_SYNC_TIMER_TIMEOUT_MASK (0xFF00U)
#define BTU2_REG_BTU_RIF_RXSYNC_TIMER_RX_SYNC_TIMER_TIMEOUT_SHIFT (8U)
/*! Rx_Sync_Timer_Timeout - Rx Sync Timer Timeout */
#define BTU2_REG_BTU_RIF_RXSYNC_TIMER_RX_SYNC_TIMER_TIMEOUT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RXSYNC_TIMER_RX_SYNC_TIMER_TIMEOUT_SHIFT)) & BTU2_REG_BTU_RIF_RXSYNC_TIMER_RX_SYNC_TIMER_TIMEOUT_MASK)
/*! @} */

/*! @name BTU_RIF_SWDBUS_CTL - RIF Software dBus Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_ADDR_MASK (0x3FFU)
#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_ADDR_SHIFT (0U)
/*! sw_dbus_addr - dBus register address */
#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_ADDR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_ADDR_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_ADDR_MASK)

#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_FINISHED_MASK (0x400U)
#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_FINISHED_SHIFT (10U)
/*! sw_dbus_finished - Poll status of dBus access
 *  0b0..busy
 *  0b1..finished
 */
#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_FINISHED(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_FINISHED_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_FINISHED_MASK)

#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_SIZE_BYTES_MASK (0x3800U)
#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_SIZE_BYTES_SHIFT (11U)
/*! sw_dbus_size_bytes - number of bytes to read or write
 *  0b000..1 byte
 *  0b001..2 bytes
 *  0b010..3 bytes
 *  0b011..4 bytes
 *  0b100..5 byteS
 *  0b101..6 bytes
 *  0b110..7 bytes
 *  0b111..8 bytes
 */
#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_SIZE_BYTES(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_SIZE_BYTES_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_SIZE_BYTES_MASK)

#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_START_MASK (0x4000U)
#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_START_SHIFT (14U)
/*! sw_dbus_start - Start a new dBus access */
#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_START(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_START_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_START_MASK)

#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_RD_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_RD_SHIFT (15U)
/*! sw_dbus_rd - Read/write control
 *  0b0..write
 *  0b1..read
 */
#define BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_RD(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_RD_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_CTL_SW_DBUS_RD_MASK)
/*! @} */

/*! @name BTU_RIF_SWDBUS_EVENT - RIF Software dBus Event */
/*! @{ */

#define BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_COUNT_MASK (0x7FFU)
#define BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_COUNT_SHIFT (0U)
/*! sw_dbus_count - Count to trigger software dBus */
#define BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_COUNT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_COUNT_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_COUNT_MASK)

#define BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_RST_MASK (0x1000U)
#define BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_RST_SHIFT (12U)
/*! sw_dbus_rst - software dBus reset */
#define BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_RST(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_RST_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_RST_MASK)

#define BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_EVENT_MASK (0xC000U)
#define BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_EVENT_SHIFT (14U)
/*! sw_dbus_event - Event to trigger software dBus access
 *  0b00..SWDBUS_EVENT_NONPKT (when there is no packet activity)
 *  0b01..SWDBUS_EVENT_PKT_ASAP (as soon as possible during packet activity)
 *  0b10..SWDBUS_EVENT_PKT_START (when rif_startCount equals sw_dbus_count)
 *  0b11..SWDBUS_EVENT_PKT_END (when rif_endCount equals sw_dbus_count)
 */
#define BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_EVENT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_EVENT_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_EVENT_SW_DBUS_EVENT_MASK)
/*! @} */

/*! @name BTU_RIF_SWDBUS_DATA_1_0 - RIF Software dBus Data_1_0 */
/*! @{ */

#define BTU2_REG_BTU_RIF_SWDBUS_DATA_1_0_SW_DBUS_WDATA0_MASK (0xFFU)
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_1_0_SW_DBUS_WDATA0_SHIFT (0U)
/*! sw_dbus_wdata0 - Software Access Data */
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_1_0_SW_DBUS_WDATA0(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_DATA_1_0_SW_DBUS_WDATA0_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_DATA_1_0_SW_DBUS_WDATA0_MASK)

#define BTU2_REG_BTU_RIF_SWDBUS_DATA_1_0_SW_DBUS_WDATA1_MASK (0xFF00U)
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_1_0_SW_DBUS_WDATA1_SHIFT (8U)
/*! sw_dbus_wdata1 - Software Access Data */
#define BTU2_REG_BTU_RIF_SWDBUS_DATA_1_0_SW_DBUS_WDATA1(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_SWDBUS_DATA_1_0_SW_DBUS_WDATA1_SHIFT)) & BTU2_REG_BTU_RIF_SWDBUS_DATA_1_0_SW_DBUS_WDATA1_MASK)
/*! @} */

