zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_AES_CRC_COR_MASK (0x200U)
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_AES_CRC_COR_SHIFT (9U)
/*! tx_acl_aes_crc_cor - TX ACL DMEM Error CRC Corruption Enable */
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_AES_CRC_COR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_AES_CRC_COR_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_AES_CRC_COR_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_DMEM_CRC_COR_MASK (0x400U)
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_DMEM_CRC_COR_SHIFT (10U)
/*! tx_acl_dmem_crc_cor - TX ACL DMA Error CRC Corruption Enable */
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_DMEM_CRC_COR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_DMEM_CRC_COR_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ACL_DMEM_CRC_COR_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_DMA_CRC_COR_MASK (0x800U)
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_DMA_CRC_COR_SHIFT (11U)
/*! tx_esco_dma_crc_cor - TX SCO AES Error CRC Corruption Enable */
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_DMA_CRC_COR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_DMA_CRC_COR_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_DMA_CRC_COR_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_AES_CRC_COR_MASK (0x1000U)
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_AES_CRC_COR_SHIFT (12U)
/*! tx_esco_aes_crc_cor - TX eSCO DMEM Error CRC Corruption Enable */
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_AES_CRC_COR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_AES_CRC_COR_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_AES_CRC_COR_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_DMEM_CRC_COR_MASK (0x2000U)
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_DMEM_CRC_COR_SHIFT (13U)
/*! tx_esco_dmem_crc_cor - TX eSCO DMA Error CRC Corruption Enable */
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_DMEM_CRC_COR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_DMEM_CRC_COR_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_ESCO_DMEM_CRC_COR_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_CRC_COR_EN_MASK (0x4000U)
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_CRC_COR_EN_SHIFT (14U)
/*! tx_crc_cor_en - Continous CRC corruption */
#define BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_CRC_COR_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_CRC_COR_EN_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_TX_CTRL_TX_CRC_COR_EN_MASK)
/*! @} */

/*! @name BTU_RIF_ERR_PATTERN_RX - RIF Error Pattern Rx */
/*! @{ */

#define BTU2_REG_BTU_RIF_ERR_PATTERN_RX_ERR_PATTERN_RX_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_ERR_PATTERN_RX_ERR_PATTERN_RX_SHIFT (0U)
/*! Err_Pattern_Rx - 16-bit Error Pattern for Rx Packets
 *  0b0000000000000000..no error injection
 *  0b0000000000000001..flip corresponding bit of Rx packets
 */
#define BTU2_REG_BTU_RIF_ERR_PATTERN_RX_ERR_PATTERN_RX(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_PATTERN_RX_ERR_PATTERN_RX_SHIFT)) & BTU2_REG_BTU_RIF_ERR_PATTERN_RX_ERR_PATTERN_RX_MASK)
/*! @} */

/*! @name BTU_RIF_ERR_DELAY1_RX - RIF Error Delay 1 Rx */
/*! @{ */

#define BTU2_REG_BTU_RIF_ERR_DELAY1_RX_ERR_DELAY1_RX_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_ERR_DELAY1_RX_ERR_DELAY1_RX_SHIFT (0U)
/*! Err_Delay1_Rx - Position of Error Insertion in Rx Packet */
#define BTU2_REG_BTU_RIF_ERR_DELAY1_RX_ERR_DELAY1_RX(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_DELAY1_RX_ERR_DELAY1_RX_SHIFT)) & BTU2_REG_BTU_RIF_ERR_DELAY1_RX_ERR_DELAY1_RX_MASK)
/*! @} */

/*! @name BTU_RIF_ERR_DELAY2_RX - RIF Error Delay 2 Rx */
/*! @{ */

#define BTU2_REG_BTU_RIF_ERR_DELAY2_RX_ERR_DELAY2_RX_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_ERR_DELAY2_RX_ERR_DELAY2_RX_SHIFT (0U)
/*! Err_Delay2_Rx - Position of Error Insertion in Rx Packet */
#define BTU2_REG_BTU_RIF_ERR_DELAY2_RX_ERR_DELAY2_RX(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_DELAY2_RX_ERR_DELAY2_RX_SHIFT)) & BTU2_REG_BTU_RIF_ERR_DELAY2_RX_ERR_DELAY2_RX_MASK)
/*! @} */

/*! @name BTU_RIF_ERR_DELAY3_RX - RIF Error Delay 3 Rx */
/*! @{ */

#define BTU2_REG_BTU_RIF_ERR_DELAY3_RX_ERR_DELAY3_RX_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_ERR_DELAY3_RX_ERR_DELAY3_RX_SHIFT (0U)
/*! Err_Delay3_Rx - Position of Error Insertion in Rx Packet */
#define BTU2_REG_BTU_RIF_ERR_DELAY3_RX_ERR_DELAY3_RX(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_DELAY3_RX_ERR_DELAY3_RX_SHIFT)) & BTU2_REG_BTU_RIF_ERR_DELAY3_RX_ERR_DELAY3_RX_MASK)
/*! @} */

/*! @name BTU_RIF_ERR_INJ_RX_CTRL - RIF Error Injection Rx Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_ERR_RX_EN_MASK (0x1U)
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_ERR_RX_EN_SHIFT (0U)
/*! Err_Rx_En - Error Injection Logic for Rx Packets
 *  0b0..disable all error injection logic for Rx packets by programming Err_Rx_Mode, nErr_Pkts_Rx, and etc. have no effect at all
 *  0b1..enable error injection logic for Rx packets
 */
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_ERR_RX_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_ERR_RX_EN_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_ERR_RX_EN_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_ERR_RX_MODE_MASK (0x2U)
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_ERR_RX_MODE_SHIFT (1U)
/*! Err_Rx_Mode - Error Injection for Rx Packets
 *  0b0..inject error on nErr_Pkts_Rx number of Rx packets
 *  0b1..inject error on all Rx packets continuously based on Err_Delay'_Rx timer selected in Frame Scheduler
 */
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_ERR_RX_MODE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_ERR_RX_MODE_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_ERR_RX_MODE_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_NERR_PKTS_RX_MASK (0xFCU)
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_NERR_PKTS_RX_SHIFT (2U)
/*! nErr_Pkts_Rx - Number of Rx Error Packets
 *  0b000000..corrupt infinite number of Rx packets
 *  0b000001..n/a
 */
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_NERR_PKTS_RX(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_NERR_PKTS_RX_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_NERR_PKTS_RX_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_DMA_CRC_COR_MASK (0x100U)
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_DMA_CRC_COR_SHIFT (8U)
/*! rx_acl_dma_crc_cor - RX ACL DMA Error CRC Corruption Enable */
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_DMA_CRC_COR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_DMA_CRC_COR_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_DMA_CRC_COR_MASK)

#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_AES_CRC_COR_MASK (0x200U)
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_AES_CRC_COR_SHIFT (9U)
/*! rx_acl_aes_crc_cor - RX SCO AES Error CRC Corruption Enable */
#define BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_AES_CRC_COR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_AES_CRC_COR_SHIFT)) & BTU2_REG_BTU_RIF_ERR_INJ_RX_CTRL_RX_ACL_AES_CRC_COR_MASK)

