zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
/*! @name BTU_RIF_RX_BLE_SAMP_PHASE_ADJ - RIF Rx Sample Phase Adjustment */
/*! @{ */

#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_PDU_START_POS_ADJ_MASK (0x3U)
#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_PDU_START_POS_ADJ_SHIFT (0U)
/*! PDU_START_POS_ADJ - Positive Phase Adjustment after PDU Data starts Pulse */
#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_PDU_START_POS_ADJ(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_PDU_START_POS_ADJ_SHIFT)) & BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_PDU_START_POS_ADJ_MASK)

#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_PDU_START_NEG_ADJ_MASK (0xCU)
#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_PDU_START_NEG_ADJ_SHIFT (2U)
/*! PDU_START_NEG_ADJ - Negative Phase Adjustment after PDU Data starts Pulse */
#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_PDU_START_NEG_ADJ(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_PDU_START_NEG_ADJ_SHIFT)) & BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_PDU_START_NEG_ADJ_MASK)

#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_1M_PHASE_POS_ADJ_MASK (0x300U)
#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_1M_PHASE_POS_ADJ_SHIFT (8U)
/*! DFE_1M_PHASE_POS_ADJ - Positive Phase Adjustment for DFE I/Q Samples After CRC */
#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_1M_PHASE_POS_ADJ(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_1M_PHASE_POS_ADJ_SHIFT)) & BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_1M_PHASE_POS_ADJ_MASK)

#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_1M_PHASE_NEG_ADJ_MASK (0xC00U)
#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_1M_PHASE_NEG_ADJ_SHIFT (10U)
/*! DFE_1M_PHASE_NEG_ADJ - Negative Phase Adjustment for DFE I/Q Samples After CRC */
#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_1M_PHASE_NEG_ADJ(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_1M_PHASE_NEG_ADJ_SHIFT)) & BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_1M_PHASE_NEG_ADJ_MASK)

#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_2M_PHASE_POS_ADJ_MASK (0x3000U)
#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_2M_PHASE_POS_ADJ_SHIFT (12U)
/*! DFE_2M_PHASE_POS_ADJ - Positive Phase Adjustment for DFE I/Q Samples After CRC */
#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_2M_PHASE_POS_ADJ(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_2M_PHASE_POS_ADJ_SHIFT)) & BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_2M_PHASE_POS_ADJ_MASK)

#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_2M_PHASE_NEG_ADJ_MASK (0xC000U)
#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_2M_PHASE_NEG_ADJ_SHIFT (14U)
/*! DFE_2M_PHASE_NEG_ADJ - Negative Phase Adjustment for DFE I/Q Samples After CRC */
#define BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_2M_PHASE_NEG_ADJ(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_2M_PHASE_NEG_ADJ_SHIFT)) & BTU2_REG_BTU_RIF_RX_BLE_SAMP_PHASE_ADJ_DFE_2M_PHASE_NEG_ADJ_MASK)
/*! @} */

/*! @name BTU_RIF_RX_TONE_CANCEL_CTRL - Rx Tone Cancellation Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_RX_DBUS_PULL_IN_TIME_MASK (0x3FU)
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_RX_DBUS_PULL_IN_TIME_SHIFT (0U)
/*! RX_DBUS_PULL_IN_TIME - Rx dBUS events pull-in time */
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_RX_DBUS_PULL_IN_TIME(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_RX_DBUS_PULL_IN_TIME_SHIFT)) & BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_RX_DBUS_PULL_IN_TIME_MASK)

#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_BTC_PULL_IN_EN_MASK (0x100U)
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_BTC_PULL_IN_EN_SHIFT (8U)
/*! BTC_PULL_IN_EN - BTC dBUS events pull-in enable
 *  0b0..disable
 *  0b1..enable
 */
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_BTC_PULL_IN_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_BTC_PULL_IN_EN_SHIFT)) & BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_BTC_PULL_IN_EN_MASK)

#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_BLE_PULL_IN_EN_MASK (0x200U)
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_BLE_PULL_IN_EN_SHIFT (9U)
/*! BLE_PULL_IN_EN - BLE dBUS events pull-in enable
 *  0b0..disable
 *  0b1..enable
 */
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_BLE_PULL_IN_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_BLE_PULL_IN_EN_SHIFT)) & BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CTRL_BLE_PULL_IN_EN_MASK)
/*! @} */

/*! @name BTU_RIF_RX_TONE_CANCEL_CHNL10 - Rx Tone Cancellation Channel */
/*! @{ */

#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL10_TONE_CANCEL_CHNL0_MASK (0x7FU)
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL10_TONE_CANCEL_CHNL0_SHIFT (0U)
/*! TONE_CANCEL_CHNL0 - Rx Tone Cancellation Channel 0 */
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL10_TONE_CANCEL_CHNL0(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL10_TONE_CANCEL_CHNL0_SHIFT)) & BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL10_TONE_CANCEL_CHNL0_MASK)

#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL10_TONE_CANCEL_CHNL1_MASK (0x7F00U)
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL10_TONE_CANCEL_CHNL1_SHIFT (8U)
/*! TONE_CANCEL_CHNL1 - Rx Tone Cancellation Channel 1 */
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL10_TONE_CANCEL_CHNL1(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL10_TONE_CANCEL_CHNL1_SHIFT)) & BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL10_TONE_CANCEL_CHNL1_MASK)
/*! @} */

/*! @name BTU_RIF_RX_TONE_CANCEL_CHNL32 - Rx Tone Cancellation Channel */
/*! @{ */

#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL32_TONE_CANCEL_CHNL2_MASK (0x7FU)
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL32_TONE_CANCEL_CHNL2_SHIFT (0U)
/*! TONE_CANCEL_CHNL2 - Rx Tone Cancellation Channel 2 */
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL32_TONE_CANCEL_CHNL2(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL32_TONE_CANCEL_CHNL2_SHIFT)) & BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL32_TONE_CANCEL_CHNL2_MASK)

#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL32_TONE_CANCEL_CHNL3_MASK (0x7F00U)
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL32_TONE_CANCEL_CHNL3_SHIFT (8U)
/*! TONE_CANCEL_CHNL3 - Rx Tone Cancellation Channel 3 */
#define BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL32_TONE_CANCEL_CHNL3(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL32_TONE_CANCEL_CHNL3_SHIFT)) & BTU2_REG_BTU_RIF_RX_TONE_CANCEL_CHNL32_TONE_CANCEL_CHNL3_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_CTL - BLE RIF Control */
/*! @{ */

