zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
#define BTU2_REG_BTU_RIF_ARB_CTL_BTC_SW_ABORT_MASK (0x1U)
#define BTU2_REG_BTU_RIF_ARB_CTL_BTC_SW_ABORT_SHIFT (0U)
#define BTU2_REG_BTU_RIF_ARB_CTL_BTC_SW_ABORT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_BTC_SW_ABORT_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_BTC_SW_ABORT_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_BLE_SW_ABORT_MASK (0x2U)
#define BTU2_REG_BTU_RIF_ARB_CTL_BLE_SW_ABORT_SHIFT (1U)
#define BTU2_REG_BTU_RIF_ARB_CTL_BLE_SW_ABORT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_BLE_SW_ABORT_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_BLE_SW_ABORT_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_ANT_SW_ABORT_MASK (0x4U)
#define BTU2_REG_BTU_RIF_ARB_CTL_ANT_SW_ABORT_SHIFT (2U)
#define BTU2_REG_BTU_RIF_ARB_CTL_ANT_SW_ABORT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_ANT_SW_ABORT_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_ANT_SW_ABORT_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_RST_RIF_ARB_FSM_MASK (0x8U)
#define BTU2_REG_BTU_RIF_ARB_CTL_RST_RIF_ARB_FSM_SHIFT (3U)
/*! rst_rif_arb_fsm - RIF-ARB Reset */
#define BTU2_REG_BTU_RIF_ARB_CTL_RST_RIF_ARB_FSM(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_RST_RIF_ARB_FSM_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_RST_RIF_ARB_FSM_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_HI_PRI_CUTOFF_DIS_MASK (0x20U)
#define BTU2_REG_BTU_RIF_ARB_CTL_HI_PRI_CUTOFF_DIS_SHIFT (5U)
/*! Hi_pri_cutoff_dis - Disable Hi priority packet cutoff
 *  0b0..enable
 *  0b1..disable
 */
#define BTU2_REG_BTU_RIF_ARB_CTL_HI_PRI_CUTOFF_DIS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_HI_PRI_CUTOFF_DIS_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_HI_PRI_CUTOFF_DIS_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_MH_PRI_CUTOFF_DIS_MASK (0x40U)
#define BTU2_REG_BTU_RIF_ARB_CTL_MH_PRI_CUTOFF_DIS_SHIFT (6U)
/*! MH_pri_cutoff_dis - Disable MH priority packet cutoff
 *  0b0..enable
 *  0b1..disable
 */
#define BTU2_REG_BTU_RIF_ARB_CTL_MH_PRI_CUTOFF_DIS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_MH_PRI_CUTOFF_DIS_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_MH_PRI_CUTOFF_DIS_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_ML_PRI_CUTOFF_DIS_MASK (0x80U)
#define BTU2_REG_BTU_RIF_ARB_CTL_ML_PRI_CUTOFF_DIS_SHIFT (7U)
/*! ML_pri_cutoff_dis - Disable ML priority packet cutoff
 *  0b0..enable
 *  0b1..disable
 */
#define BTU2_REG_BTU_RIF_ARB_CTL_ML_PRI_CUTOFF_DIS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_ML_PRI_CUTOFF_DIS_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_ML_PRI_CUTOFF_DIS_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_BTC_SYNC_FRAME_EN_MASK (0x100U)
#define BTU2_REG_BTU_RIF_ARB_CTL_BTC_SYNC_FRAME_EN_SHIFT (8U)
/*! btc_sync_frame_en - Enable btc_sync_frame in arbitration decision
 *  0b0..disable
 *  0b1..enable
 */
#define BTU2_REG_BTU_RIF_ARB_CTL_BTC_SYNC_FRAME_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_BTC_SYNC_FRAME_EN_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_BTC_SYNC_FRAME_EN_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_BLE_SYNC_FRAME_EN_MASK (0x200U)
#define BTU2_REG_BTU_RIF_ARB_CTL_BLE_SYNC_FRAME_EN_SHIFT (9U)
/*! ble_sync_frame_en - Enable ble_sync_frame in arbitration decision
 *  0b0..disable
 *  0b1..enable
 */
#define BTU2_REG_BTU_RIF_ARB_CTL_BLE_SYNC_FRAME_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_BLE_SYNC_FRAME_EN_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_BLE_SYNC_FRAME_EN_MASK)
/*! @} */

/*! @name BTU_RIF_ARB_CTL_1 - RIF ARB Control */
/*! @{ */

#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_HI_MASK (0x7U)
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_HI_SHIFT (0U)
/*! eq_pri_winner_Hi - Arbitration rule for if BTC, BLE and ANT packet are same High priority
 *  0b000..BTC > BLE > ANT
 *  0b001..BLE > BTC > ANT
 *  0b010..BTC > ANT > BLE
 *  0b011..BLE > ANT > BTC
 *  0b100..ANT > BTC > BLE
 *  0b101..ANT > BLE > BTC
 *  0b110..Simple Round Robin
 *  0b111..reserved
 */
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_HI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_HI_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_HI_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_HI_CUTOFF_DIS_MASK (0x8U)
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_HI_CUTOFF_DIS_SHIFT (3U)
/*! eq_pri_Hi_cutoff_dis - Disable Hi priority packet cutoff
 *  0b0..enable
 *  0b1..disable
 */
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_HI_CUTOFF_DIS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_HI_CUTOFF_DIS_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_HI_CUTOFF_DIS_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_MH_MASK (0x70U)
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_MH_SHIFT (4U)
/*! eq_pri_winner_MH - Arbitration rule for if BTC, BLE and ANT packet are same MH priority
 *  0b000..BTC > BLE > ANT
 *  0b001..BLE > BTC > ANT
 *  0b010..BTC > ANT > BLE
 *  0b011..BLE > ANT > BTC
 *  0b100..ANT > BTC > BLE
 *  0b101..ANT > BLE > BTC
 *  0b110..Simple Round Robin
 *  0b111..reserved
 */
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_MH(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_MH_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_MH_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_MH_CUTOFF_DIS_MASK (0x80U)
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_MH_CUTOFF_DIS_SHIFT (7U)
/*! eq_pri_MH_cutoff_dis - Disable MH priority packet cutoff
 *  0b0..enable
 *  0b1..disable
 */
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_MH_CUTOFF_DIS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_MH_CUTOFF_DIS_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_MH_CUTOFF_DIS_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_ML_MASK (0x700U)
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_ML_SHIFT (8U)
/*! eq_pri_winner_ML - Arbitration rule for if BTC, BLE and ANT packet are same ML priority
 *  0b000..BTC > BLE > ANT
 *  0b001..BLE > BTC > ANT
 *  0b010..BTC > ANT > BLE
 *  0b011..BLE > ANT > BTC
 *  0b100..ANT > BTC > BLE
 *  0b101..ANT > BLE > BTC
 *  0b110..Simple Round Robin
 *  0b111..reserved
 */
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_ML(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_ML_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_ML_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_ML_CUTOFF_DIS_MASK (0x800U)
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_ML_CUTOFF_DIS_SHIFT (11U)
/*! eq_pri_ML_cutoff_dis - Disable ML priority packet cutoff
 *  0b0..enable
 *  0b1..disable
 */
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_ML_CUTOFF_DIS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_ML_CUTOFF_DIS_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_ML_CUTOFF_DIS_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_LO_MASK (0x7000U)
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_LO_SHIFT (12U)
/*! eq_pri_winner_Lo - Arbitration rule for if BTC, BLE and ANT packet are same Low priority
 *  0b000..BTC > BLE > ANT
 *  0b001..BLE > BTC > ANT
 *  0b010..BTC > ANT > BLE
 *  0b011..BLE > ANT > BTC
 *  0b100..ANT > BTC > BLE
 *  0b101..ANT > BLE > BTC
 *  0b110..Simple Round Robin
 *  0b111..reserved
 */
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_LO(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_LO_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_WINNER_LO_MASK)

#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_LO_CUTOFF_DIS_MASK (0x8000U)
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_LO_CUTOFF_DIS_SHIFT (15U)
/*! eq_pri_Lo_cutoff_dis - Disable Lo priority packet cutoff
 *  0b0..enable
 *  0b1..disable
 */
#define BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_LO_CUTOFF_DIS(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_LO_CUTOFF_DIS_SHIFT)) & BTU2_REG_BTU_RIF_ARB_CTL_1_EQ_PRI_LO_CUTOFF_DIS_MASK)
/*! @} */

/*! @name BTU_RIF_TESTBUS_SEL_0 - RIF Testbus Select 0 */
/*! @{ */

#define BTU2_REG_BTU_RIF_TESTBUS_SEL_0_BTU_TESTBUS_SEL_0_MASK (0xFFFFU)
#define BTU2_REG_BTU_RIF_TESTBUS_SEL_0_BTU_TESTBUS_SEL_0_SHIFT (0U)
/*! btu_testbus_sel_0 - RIF Testbus Select, Lower Bits
 *  0b0000000000000000..get btc_testbus_out[i]
 *  0b0000000000000001..get ble_testbus_out[i]
 *  0b0000000000000010..get ble_debug_sw_msg_out(URAT)
 *  0b0000000000000011..get ble_test_sw_out[i]
 */
#define BTU2_REG_BTU_RIF_TESTBUS_SEL_0_BTU_TESTBUS_SEL_0(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_TESTBUS_SEL_0_BTU_TESTBUS_SEL_0_SHIFT)) & BTU2_REG_BTU_RIF_TESTBUS_SEL_0_BTU_TESTBUS_SEL_0_MASK)
/*! @} */

/*! @name BTU_RIF_TESTBUS_SEL_1 - RIF Testbus Select 1 */
/*! @{ */

