zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_ZERO_MASK (0x20U)
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_ZERO_SHIFT (5U)
/*! bt_reg_btc_force_clk_zero - BTC Force Clock Zero */
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_ZERO(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_ZERO_SHIFT)) & BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_BTC_FORCE_CLK_ZERO_MASK)

#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_FORCE_EBRAM_SYSCLK_EN_MASK (0x40U)
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_FORCE_EBRAM_SYSCLK_EN_SHIFT (6U)
/*! bt_reg_force_ebram_sysclk_en - Force EBRAM ebSysClk enable */
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_FORCE_EBRAM_SYSCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_FORCE_EBRAM_SYSCLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BT_CLK_GATING_BT_REG_FORCE_EBRAM_SYSCLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BTC_CLK_REQ_EARLY_ASSERT_MASK (0x100U)
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BTC_CLK_REQ_EARLY_ASSERT_SHIFT (8U)
/*! btc_clk_req_early_assert - BTC_clk_req early assertion upon any BTC AHB access */
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BTC_CLK_REQ_EARLY_ASSERT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BT_CLK_GATING_BTC_CLK_REQ_EARLY_ASSERT_SHIFT)) & BTU2_REG_BTU_RIF_BT_CLK_GATING_BTC_CLK_REQ_EARLY_ASSERT_MASK)

#define BTU2_REG_BTU_RIF_BT_CLK_GATING_LCCLKENOUT_EARLY_UNGATE_MASK (0x200U)
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_LCCLKENOUT_EARLY_UNGATE_SHIFT (9U)
/*! lcClkEnOut_early_ungate - lcClkEnOut early upgated upon any BTC AHB access */
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_LCCLKENOUT_EARLY_UNGATE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BT_CLK_GATING_LCCLKENOUT_EARLY_UNGATE_SHIFT)) & BTU2_REG_BTU_RIF_BT_CLK_GATING_LCCLKENOUT_EARLY_UNGATE_MASK)

#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BTC_SYS_4M_EARLY_UNGATE_MASK (0x400U)
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BTC_SYS_4M_EARLY_UNGATE_SHIFT (10U)
/*! btc_sys_4m_early_ungate - BTC_sys_clk and btc_4m_clk early ungated upon any BTC AHB access */
#define BTU2_REG_BTU_RIF_BT_CLK_GATING_BTC_SYS_4M_EARLY_UNGATE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BT_CLK_GATING_BTC_SYS_4M_EARLY_UNGATE_SHIFT)) & BTU2_REG_BTU_RIF_BT_CLK_GATING_BTC_SYS_4M_EARLY_UNGATE_MASK)
/*! @} */

/*! @name BTU_RIF_CLK_SMPLD - RIF Clock Sampled */
/*! @{ */

#define BTU2_REG_BTU_RIF_CLK_SMPLD_BTU_4M_SMPLD_MUX_MASK (0x1U)
#define BTU2_REG_BTU_RIF_CLK_SMPLD_BTU_4M_SMPLD_MUX_SHIFT (0U)
/*! btu_4m_smpld_mux - 4M Sampled MUX */
#define BTU2_REG_BTU_RIF_CLK_SMPLD_BTU_4M_SMPLD_MUX(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_CLK_SMPLD_BTU_4M_SMPLD_MUX_SHIFT)) & BTU2_REG_BTU_RIF_CLK_SMPLD_BTU_4M_SMPLD_MUX_MASK)

#define BTU2_REG_BTU_RIF_CLK_SMPLD_RIF_RX_4M_SMPLD_MUX_MASK (0x2U)
#define BTU2_REG_BTU_RIF_CLK_SMPLD_RIF_RX_4M_SMPLD_MUX_SHIFT (1U)
/*! rif_rx_4m_smpld_mux - RIF Rx 4M Sampled MUX */
#define BTU2_REG_BTU_RIF_CLK_SMPLD_RIF_RX_4M_SMPLD_MUX(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_CLK_SMPLD_RIF_RX_4M_SMPLD_MUX_SHIFT)) & BTU2_REG_BTU_RIF_CLK_SMPLD_RIF_RX_4M_SMPLD_MUX_MASK)

#define BTU2_REG_BTU_RIF_CLK_SMPLD_LPOCLK_SMPLD_MUX_MASK (0x4U)
#define BTU2_REG_BTU_RIF_CLK_SMPLD_LPOCLK_SMPLD_MUX_SHIFT (2U)
/*! lpoClk_smpld_mux - LPO Clock Sampled MUX
 *  0b0..selects old way for lpoClkSmpld signal generation
 *  0b1..selects new way for lpoClkSmpls signal generation
 */
#define BTU2_REG_BTU_RIF_CLK_SMPLD_LPOCLK_SMPLD_MUX(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_CLK_SMPLD_LPOCLK_SMPLD_MUX_SHIFT)) & BTU2_REG_BTU_RIF_CLK_SMPLD_LPOCLK_SMPLD_MUX_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_CLK_GATING - RIF BLE Clock Gating */
/*! @{ */

#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_SLEEP_CLK_EN_MASK (0x1U)
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_SLEEP_CLK_EN_SHIFT (0U)
/*! bt_reg_ble_sleep_clk_en - BLE Sleep Clock Enable */
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_SLEEP_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_SLEEP_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_SLEEP_CLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_FORCE_CLK_EN_MASK (0x2U)
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_FORCE_CLK_EN_SHIFT (1U)
/*! bt_reg_ble_force_clk_en - BLE Force Clock Enable */
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_FORCE_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_FORCE_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_FORCE_CLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_SLV_HCLK_EN_MASK (0x4U)
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_SLV_HCLK_EN_SHIFT (2U)
/*! bt_reg_ble_slv_hclk_en - BLE Slave HCLK Enable
 *  0b0..ble_slv_hclk_en controls clock gating dynamically
 *  0b1..forces ble_sys_td_clk_en to turn on
 */
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_SLV_HCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_SLV_HCLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_SLV_HCLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_MST_HCLK_EN_MASK (0x8U)
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_MST_HCLK_EN_SHIFT (3U)
/*! bt_reg_ble_mst_hclk_en - BLE Master HCLK Enable
 *  0b0..ble_mst_hclk_en controls clock gating
 *  0b1..forces ble_mst_hclk to 1
 */
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_MST_HCLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_MST_HCLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_MST_HCLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RIC_SYS_CLK_EN_MASK (0x10U)
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RIC_SYS_CLK_EN_SHIFT (4U)
/*! bt_reg_ble_ric_sys_clk_en - BLE RIC System Clock Enable
 *  0b0..ble_ric_sys_clk_en controls dynamic clock gating
 *  0b1..force ble_ric_sys_clk to turn on
 */
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RIC_SYS_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RIC_SYS_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RIC_SYS_CLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_TX_CLK_EN_MASK (0x20U)
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_TX_CLK_EN_SHIFT (5U)
/*! bt_reg_ble_tx_clk_en - BLE Tx Clock Enable
 *  0b0..ble_tx_clk_en controls clock gating for ble_tx_clk
 *  0b1..forces ble_tx_clk; also forces ble_td_sys_clk_en to be set
 */
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_TX_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_TX_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_TX_CLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RX_CLK_EN_MASK (0x40U)
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RX_CLK_EN_SHIFT (6U)
/*! bt_reg_ble_rx_clk_en - BLE Rx Clock Enable
 *  0b0..ble_rx_clk controls clock gating dynamically
 *  0b1..forces ble_rx_clk clocks to turn on; also forces ble_rd_sys_clk to turn on
 */
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RX_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RX_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RX_CLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_TD_SYS_CLK_EN_MASK (0x80U)
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_TD_SYS_CLK_EN_SHIFT (7U)
/*! bt_reg_ble_td_sys_clk_en - BLE TD System Clock Enable
 *  0b0..ble_td_sys_clk_en controls clock gating dynamically
 *  0b1..forces ble_td_sys_clk to turn on
 */
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_TD_SYS_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_TD_SYS_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_TD_SYS_CLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RD_SYS_CLK_EN_MASK (0x100U)
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RD_SYS_CLK_EN_SHIFT (8U)
/*! bt_reg_ble_rd_sys_clk_en - BLE RD System Clock Enable
 *  0b0..ble_rd_sys_clk_en controls dynamic clock gating
 *  0b1..forces ble_rd_sys_clk to turn on
 */
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RD_SYS_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RD_SYS_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RD_SYS_CLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RL_SYS_CLK_EN_MASK (0x200U)
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RL_SYS_CLK_EN_SHIFT (9U)
/*! bt_reg_ble_rl_sys_clk_en - BLE RD System Clock Enable
 *  0b0..ble_rl_sys_clk_en controls dynamic clock gating
 *  0b1..forces forces ble_rl_sys_clk to turn on
 */
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RL_SYS_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RL_SYS_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_RL_SYS_CLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_WL_SYS_CLK_EN_MASK (0x400U)
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_WL_SYS_CLK_EN_SHIFT (10U)
/*! bt_reg_ble_wl_sys_clk_en - BLE Whitelist Search System Clock Enable
 *  0b0..ble_wl_sys_clk_en controls dynamic clock gating
 *  0b1..forces ble_wl_sys_clk to turn on
 */
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_WL_SYS_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_WL_SYS_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_WL_SYS_CLK_EN_MASK)

#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_IRK_SYS_CLK_EN_MASK (0x800U)
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_IRK_SYS_CLK_EN_SHIFT (11U)
/*! bt_reg_ble_irk_sys_clk_en - BLE IRK resolve System Clock Enable
 *  0b0..ble_irk_sys_clk_en controls dynamic clock gating
 *  0b1..forces ble_irk_sys_clk to turn on
 */
#define BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_IRK_SYS_CLK_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_IRK_SYS_CLK_EN_SHIFT)) & BTU2_REG_BTU_RIF_BLE_CLK_GATING_BT_REG_BLE_IRK_SYS_CLK_EN_MASK)
/*! @} */

/*! @name BTU_RIF_BLE_CLK_CTRL - RIF BLE Clock Control */
/*! @{ */

