zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_LLRINITTXPRI_MASK (0x20U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_LLRINITTXPRI_SHIFT (5U)
/*! llrInitTxPri - LLR Initiator Tx priority */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_LLRINITTXPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_LLRINITTXPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_LLRINITTXPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_LLRINITRXPRI_MASK (0x40U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_LLRINITRXPRI_SHIFT (6U)
/*! llrInitRxPri - LLR Initiator Rx priority */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_LLRINITRXPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_LLRINITRXPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_LLRINITRXPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ESCOINSTPRI_MASK (0x80U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ESCOINSTPRI_SHIFT (7U)
/*! eScoInstPri - eSCO Instant */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ESCOINSTPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ESCOINSTPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ESCOINSTPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ESCORETRPRI_MASK (0x100U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ESCORETRPRI_SHIFT (8U)
/*! eScoRetrPri - eSCO Retransmission */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ESCORETRPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ESCORETRPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ESCORETRPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_SCOPRI_MASK (0x200U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_SCOPRI_SHIFT (9U)
/*! scoPri - SCO */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_SCOPRI(x)  (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_SCOPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_SCOPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_BROADCASTPRI_MASK (0x400U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_BROADCASTPRI_SHIFT (10U)
/*! broadcastPri - Broadcast */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_BROADCASTPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_BROADCASTPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_BROADCASTPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ACLPRI_MASK (0x800U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ACLPRI_SHIFT (11U)
/*! aclPri - ACL */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ACLPRI(x)  (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ACLPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_ACLPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_IRESPPRI_MASK (0x1000U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_IRESPPRI_SHIFT (12U)
/*! iRespPri - Inquiry Response */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_IRESPPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_IRESPPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_IRESPPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_SLVRESPPRI_MASK (0x2000U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_SLVRESPPRI_SHIFT (13U)
/*! slvRespPri - Slave Page Response */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_SLVRESPPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_SLVRESPPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_SLVRESPPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_POLLPRI_MASK (0x4000U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_POLLPRI_SHIFT (14U)
/*! pollPri - Poll packet */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_POLLPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_POLLPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_POLLPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_MSTRRESPPRI_MASK (0x8000U)
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_MSTRRESPPRI_SHIFT (15U)
/*! mstrRespPri - Master Page Response */
#define BTU2_REG_BTU_PTA_SEL_PRI_HIGH_MSTRRESPPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_PRI_HIGH_MSTRRESPPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_PRI_HIGH_MSTRRESPPRI_MASK)
/*! @} */

/*! @name BTU_PTA_CTRL - PTA Control */
/*! @{ */

#define BTU2_REG_BTU_PTA_CTRL_BTC_PRIORITY_MODE_MASK (0x1U)
#define BTU2_REG_BTU_PTA_CTRL_BTC_PRIORITY_MODE_SHIFT (0U)
/*! btc_priority_mode - BTC BCA Coex Priority Mode
 *  0b0..BTC BCA coex priority is the same as PTA coex priority for RIF_ARB arbitration
 *  0b1..BTC BCA coex priority is from packet transaction request which falls in BTU_PTA_SEL_BCA_PRI_HIGH/BTU_PTA_SEL_BCA_PRI_MED category
 */
#define BTU2_REG_BTU_PTA_CTRL_BTC_PRIORITY_MODE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_CTRL_BTC_PRIORITY_MODE_SHIFT)) & BTU2_REG_BTU_PTA_CTRL_BTC_PRIORITY_MODE_MASK)

#define BTU2_REG_BTU_PTA_CTRL_BTC_USE_SAM_MASK   (0x4U)
#define BTU2_REG_BTU_PTA_CTRL_BTC_USE_SAM_SHIFT  (2U)
/*! btc_use_sam - SAM Coexistence Feature Enable */
#define BTU2_REG_BTU_PTA_CTRL_BTC_USE_SAM(x)     (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_CTRL_BTC_USE_SAM_SHIFT)) & BTU2_REG_BTU_PTA_CTRL_BTC_USE_SAM_MASK)

#define BTU2_REG_BTU_PTA_CTRL_SLVNORESPABORT_MASK (0x20U)
#define BTU2_REG_BTU_PTA_CTRL_SLVNORESPABORT_SHIFT (5U)
/*! slvNoRespAbort - Slave No Response Abort Enable
 *  0b0..Deasserts after Rx-to-Tx slot change
 *  0b1..Deasserts immediately after HEC received
 */
#define BTU2_REG_BTU_PTA_CTRL_SLVNORESPABORT(x)  (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_CTRL_SLVNORESPABORT_SHIFT)) & BTU2_REG_BTU_PTA_CTRL_SLVNORESPABORT_MASK)

#define BTU2_REG_BTU_PTA_CTRL_BT_GRANT_BYPASS_EN_MASK (0x40U)
#define BTU2_REG_BTU_PTA_CTRL_BT_GRANT_BYPASS_EN_SHIFT (6U)
/*! bt_grant_bypass_en - BCA coex grant bypass enable
 *  0b0..disable bt_grant_n bypass
 *  0b1..enable bt_grant_n bypass
 */
#define BTU2_REG_BTU_PTA_CTRL_BT_GRANT_BYPASS_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_CTRL_BT_GRANT_BYPASS_EN_SHIFT)) & BTU2_REG_BTU_PTA_CTRL_BT_GRANT_BYPASS_EN_MASK)

#define BTU2_REG_BTU_PTA_CTRL_BT_GRANT_BYPASS_VAL_MASK (0x80U)
#define BTU2_REG_BTU_PTA_CTRL_BT_GRANT_BYPASS_VAL_SHIFT (7U)
/*! bt_grant_bypass_val - BCA coex grant bypass value
 *  0b0..set BCA coex grant bt_grant_n to zero
 *  0b1..set BCA coex grant bt_grant_n to one
 */
#define BTU2_REG_BTU_PTA_CTRL_BT_GRANT_BYPASS_VAL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_CTRL_BT_GRANT_BYPASS_VAL_SHIFT)) & BTU2_REG_BTU_PTA_CTRL_BT_GRANT_BYPASS_VAL_MASK)

#define BTU2_REG_BTU_PTA_CTRL_CLRALLTXCNTRS_MASK (0x100U)
#define BTU2_REG_BTU_PTA_CTRL_CLRALLTXCNTRS_SHIFT (8U)
/*! clrAllTxCntrs - Clear All Tx Counters
 *  0b0..do not clear counters
 *  0b1..clear counters
 */
#define BTU2_REG_BTU_PTA_CTRL_CLRALLTXCNTRS(x)   (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_CTRL_CLRALLTXCNTRS_SHIFT)) & BTU2_REG_BTU_PTA_CTRL_CLRALLTXCNTRS_MASK)

