zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
#define BTU2_REG_BTU_PTA_BLE_RIF_ARB_COEX_PRI_BLE_TX_PRI_MASK (0x3U)
#define BTU2_REG_BTU_PTA_BLE_RIF_ARB_COEX_PRI_BLE_TX_PRI_SHIFT (0U)
/*! ble_tx_pri - BLE Coex Priority */
#define BTU2_REG_BTU_PTA_BLE_RIF_ARB_COEX_PRI_BLE_TX_PRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_BLE_RIF_ARB_COEX_PRI_BLE_TX_PRI_SHIFT)) & BTU2_REG_BTU_PTA_BLE_RIF_ARB_COEX_PRI_BLE_TX_PRI_MASK)

#define BTU2_REG_BTU_PTA_BLE_RIF_ARB_COEX_PRI_BLE_RX_PRI_MASK (0x300U)
#define BTU2_REG_BTU_PTA_BLE_RIF_ARB_COEX_PRI_BLE_RX_PRI_SHIFT (8U)
/*! ble_rx_pri - BLE Coex Priority */
#define BTU2_REG_BTU_PTA_BLE_RIF_ARB_COEX_PRI_BLE_RX_PRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_BLE_RIF_ARB_COEX_PRI_BLE_RX_PRI_SHIFT)) & BTU2_REG_BTU_PTA_BLE_RIF_ARB_COEX_PRI_BLE_RX_PRI_MASK)
/*! @} */

/*! @name BTU_PTA_BLE_BCA_COEX_PRI - BLE PTA Priority for BCA arbitration */
/*! @{ */

#define BTU2_REG_BTU_PTA_BLE_BCA_COEX_PRI_BLE_TX_PRI_MASK (0x3U)
#define BTU2_REG_BTU_PTA_BLE_BCA_COEX_PRI_BLE_TX_PRI_SHIFT (0U)
/*! ble_tx_pri - BLE Coex Priority */
#define BTU2_REG_BTU_PTA_BLE_BCA_COEX_PRI_BLE_TX_PRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_BLE_BCA_COEX_PRI_BLE_TX_PRI_SHIFT)) & BTU2_REG_BTU_PTA_BLE_BCA_COEX_PRI_BLE_TX_PRI_MASK)

#define BTU2_REG_BTU_PTA_BLE_BCA_COEX_PRI_BLE_RX_PRI_MASK (0x300U)
#define BTU2_REG_BTU_PTA_BLE_BCA_COEX_PRI_BLE_RX_PRI_SHIFT (8U)
/*! ble_rx_pri - BLE Coex Priority */
#define BTU2_REG_BTU_PTA_BLE_BCA_COEX_PRI_BLE_RX_PRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_BLE_BCA_COEX_PRI_BLE_RX_PRI_SHIFT)) & BTU2_REG_BTU_PTA_BLE_BCA_COEX_PRI_BLE_RX_PRI_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_INACTIVITY_REFCLK_0 - Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFCLK_0_MWSINACTMSG_REFCLK_MASK (0xFFFFU)
#define BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFCLK_0_MWSINACTMSG_REFCLK_SHIFT (0U)
/*! mwsInactMsg_refClk - Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt */
#define BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFCLK_0_MWSINACTMSG_REFCLK(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFCLK_0_MWSINACTMSG_REFCLK_SHIFT)) & BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFCLK_0_MWSINACTMSG_REFCLK_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_INACTIVITY_REFCLK_1 - Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFCLK_1_MWSINACTMSG_REFCLK_MASK (0x3FFU)
#define BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFCLK_1_MWSINACTMSG_REFCLK_SHIFT (0U)
/*! mwsInactMsg_refClk - Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt */
#define BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFCLK_1_MWSINACTMSG_REFCLK(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFCLK_1_MWSINACTMSG_REFCLK_SHIFT)) & BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFCLK_1_MWSINACTMSG_REFCLK_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_INACTIVITY_REFPDB_CNT - Bluetooth Reference pdBitCounter Snapshot on MWS_Inact_Msg_Real_Int Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFPDB_CNT_MWSINACTMSG_PDBITCNT_MASK (0x1FFFU)
#define BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFPDB_CNT_MWSINACTMSG_PDBITCNT_SHIFT (0U)
/*! mwsInactMsg_pdBitCnt - Bluetooth Reference pdBitCounter Snapshot on MWS_Inact_Msg_Real_Int Interrupt */
#define BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFPDB_CNT_MWSINACTMSG_PDBITCNT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFPDB_CNT_MWSINACTMSG_PDBITCNT_SHIFT)) & BTU2_REG_BTU_PTA_MWS_INACTIVITY_REFPDB_CNT_MWSINACTMSG_PDBITCNT_MASK)
/*! @} */

/*! @name BTU_PTA_INBAND_FREQ_SET_1 - PTA Inband Frequency Set 0 */
/*! @{ */

#define BTU2_REG_BTU_PTA_INBAND_FREQ_SET_1_BT_IN_BAND_LO_MASK (0xFFU)
#define BTU2_REG_BTU_PTA_INBAND_FREQ_SET_1_BT_IN_BAND_LO_SHIFT (0U)
/*! BT_In_Band_Lo - Bluetooth In Band Low */
#define BTU2_REG_BTU_PTA_INBAND_FREQ_SET_1_BT_IN_BAND_LO(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_INBAND_FREQ_SET_1_BT_IN_BAND_LO_SHIFT)) & BTU2_REG_BTU_PTA_INBAND_FREQ_SET_1_BT_IN_BAND_LO_MASK)

#define BTU2_REG_BTU_PTA_INBAND_FREQ_SET_1_BT_IN_BAND_HI_MASK (0xFF00U)
#define BTU2_REG_BTU_PTA_INBAND_FREQ_SET_1_BT_IN_BAND_HI_SHIFT (8U)
/*! BT_In_Band_Hi - Bluetooth In Band High */
#define BTU2_REG_BTU_PTA_INBAND_FREQ_SET_1_BT_IN_BAND_HI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_INBAND_FREQ_SET_1_BT_IN_BAND_HI_SHIFT)) & BTU2_REG_BTU_PTA_INBAND_FREQ_SET_1_BT_IN_BAND_HI_MASK)
/*! @} */

/*! @name BTU_PTA_MODE_SELECT - PTA Mode Select */
/*! @{ */

#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_COEX_MODE_MASK (0x7U)
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_COEX_MODE_SHIFT (0U)
/*! BT_Coex_Mode - Bluetooth Coexistence Mode Select
 *  0b000..disable
 *  0b001..CSR mode
 *  0b010..MRVL mode
 *  0b011..SUSHI mode
 */
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_COEX_MODE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MODE_SELECT_BT_COEX_MODE_SHIFT)) & BTU2_REG_BTU_PTA_MODE_SELECT_BT_COEX_MODE_MASK)

#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_MWS_COEX_EN_MASK (0x8U)
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_MWS_COEX_EN_SHIFT (3U)
/*! BT_Mws_Coex_En - Bluetooth and MWS Coexistence Mode Enable */
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_MWS_COEX_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MODE_SELECT_BT_MWS_COEX_EN_SHIFT)) & BTU2_REG_BTU_PTA_MODE_SELECT_BT_MWS_COEX_EN_MASK)

#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_OVLP_MODE_MASK (0x10U)
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_OVLP_MODE_SHIFT (4U)
/*! bt_ovlp_mode - Bluetooth Overlap Mode
 *  0b0..non-filtered, old design
 *  0b1..filtered mode
 */
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_OVLP_MODE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MODE_SELECT_BT_OVLP_MODE_SHIFT)) & BTU2_REG_BTU_PTA_MODE_SELECT_BT_OVLP_MODE_MASK)

#define BTU2_REG_BTU_PTA_MODE_SELECT_OVLP_SUPRESS_EN_MASK (0x20U)
#define BTU2_REG_BTU_PTA_MODE_SELECT_OVLP_SUPRESS_EN_SHIFT (5U)
/*! ovlp_supress_en - Overlap Suppression Enable
 *  0b0..disable
 *  0b1..enable BT_Overlap/BT_Scan_Overlap assertion to BCA will be suppressed if Tx_Power_Index Value is less
 *       than the programmed BTU_PTA_TX_POWER_THRESHOLD for BR/EDR packet type or is less than
 *       BTU_PTA_BLE_TX_PWR_THRHD for BLE packet.
 */
#define BTU2_REG_BTU_PTA_MODE_SELECT_OVLP_SUPRESS_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MODE_SELECT_OVLP_SUPRESS_EN_SHIFT)) & BTU2_REG_BTU_PTA_MODE_SELECT_OVLP_SUPRESS_EN_MASK)

#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_SCAN_OVLP_MODE_MASK (0x40U)
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_SCAN_OVLP_MODE_SHIFT (6U)
/*! bt_scan_ovlp_mode - Bluetooth Scan Overlap Mode
 *  0b0..non-filtered, old design
 *  0b1..filtered mode
 */
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_SCAN_OVLP_MODE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MODE_SELECT_BT_SCAN_OVLP_MODE_SHIFT)) & BTU2_REG_BTU_PTA_MODE_SELECT_BT_SCAN_OVLP_MODE_MASK)

#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_SCAN_OVLP_RX_EN_MASK (0x80U)
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_SCAN_OVLP_RX_EN_SHIFT (7U)
/*! bt_scan_ovlp_rx_en - Scan Overlap for Bluetooth Rx
 *  0b0..disable
 *  0b1..enable
 */
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_SCAN_OVLP_RX_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MODE_SELECT_BT_SCAN_OVLP_RX_EN_SHIFT)) & BTU2_REG_BTU_PTA_MODE_SELECT_BT_SCAN_OVLP_RX_EN_MASK)

#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_3DG_COEX_EN_MASK (0x100U)
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_3DG_COEX_EN_SHIFT (8U)
/*! BT_3dg_Coex_En - Bluetooth and 3D-Glass Coexistence Mode Enable */
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_3DG_COEX_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MODE_SELECT_BT_3DG_COEX_EN_SHIFT)) & BTU2_REG_BTU_PTA_MODE_SELECT_BT_3DG_COEX_EN_MASK)

