zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_IN_BAND1_FREQ_EN_MASK (0x200U)
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_IN_BAND1_FREQ_EN_SHIFT (9U)
/*! BT_In_Band1_Freq_En - BTU_PTA_INBAND_FREQ_SET_1 Band Gap Use Enable */
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_IN_BAND1_FREQ_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MODE_SELECT_BT_IN_BAND1_FREQ_EN_SHIFT)) & BTU2_REG_BTU_PTA_MODE_SELECT_BT_IN_BAND1_FREQ_EN_MASK)

#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_TX_ON_MODE_MASK (0xC000U)
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_TX_ON_MODE_SHIFT (14U)
/*! bt_tx_on_mode - BT_TX_ON mode selection */
#define BTU2_REG_BTU_PTA_MODE_SELECT_BT_TX_ON_MODE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MODE_SELECT_BT_TX_ON_MODE_SHIFT)) & BTU2_REG_BTU_PTA_MODE_SELECT_BT_TX_ON_MODE_MASK)
/*! @} */

/*! @name BTU_PTA_INBAND_FREQ_SET_0 - PTA Inband Frequency Set 1 */
/*! @{ */

#define BTU2_REG_BTU_PTA_INBAND_FREQ_SET_0_BT_IN_BAND_LO_MASK (0xFFU)
#define BTU2_REG_BTU_PTA_INBAND_FREQ_SET_0_BT_IN_BAND_LO_SHIFT (0U)
/*! BT_In_Band_Lo - Bluetooth In Band Low */
#define BTU2_REG_BTU_PTA_INBAND_FREQ_SET_0_BT_IN_BAND_LO(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_INBAND_FREQ_SET_0_BT_IN_BAND_LO_SHIFT)) & BTU2_REG_BTU_PTA_INBAND_FREQ_SET_0_BT_IN_BAND_LO_MASK)

#define BTU2_REG_BTU_PTA_INBAND_FREQ_SET_0_BT_IN_BAND_HI_MASK (0xFF00U)
#define BTU2_REG_BTU_PTA_INBAND_FREQ_SET_0_BT_IN_BAND_HI_SHIFT (8U)
/*! BT_In_Band_Hi - Bluetooth In Band High */
#define BTU2_REG_BTU_PTA_INBAND_FREQ_SET_0_BT_IN_BAND_HI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_INBAND_FREQ_SET_0_BT_IN_BAND_HI_SHIFT)) & BTU2_REG_BTU_PTA_INBAND_FREQ_SET_0_BT_IN_BAND_HI_MASK)
/*! @} */

/*! @name BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0 - Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0_HARQPATTERNSEL_REFCLK_MASK (0xFFFFU)
#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0_HARQPATTERNSEL_REFCLK_SHIFT (0U)
/*! harqPatternSel_refClk - Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt */
#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0_HARQPATTERNSEL_REFCLK(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0_HARQPATTERNSEL_REFCLK_SHIFT)) & BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0_HARQPATTERNSEL_REFCLK_MASK)
/*! @} */

/*! @name BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1 - Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1_HARQPATTERNSEL_REFCLK_MASK (0x3FFU)
#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1_HARQPATTERNSEL_REFCLK_SHIFT (0U)
/*! harqPatternSel_refClk - Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt */
#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1_HARQPATTERNSEL_REFCLK(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1_HARQPATTERNSEL_REFCLK_SHIFT)) & BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1_HARQPATTERNSEL_REFCLK_MASK)
/*! @} */

/*! @name BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT - Bluetooth Reference pdBitCounter Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT_HARQPATTERNSEL_PDBITCNT_MASK (0x1FFFU)
#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT_HARQPATTERNSEL_PDBITCNT_SHIFT (0U)
/*! harqPatternSel_pdBitCnt - Bluetooth Reference pdBitCounter Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt */
#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT_HARQPATTERNSEL_PDBITCNT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT_HARQPATTERNSEL_PDBITCNT_SHIFT)) & BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT_HARQPATTERNSEL_PDBITCNT_MASK)
/*! @} */

/*! @name BTU_PTA_HARQ_PATTERN_SEL_VAL - MWS Coex Signal HARQ_PATTERN_SEL Value */
/*! @{ */

#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_VAL_HARQPATTERNSELREG_MASK (0xFU)
#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_VAL_HARQPATTERNSELREG_SHIFT (0U)
/*! harqPatternSelReg - MWS Coex Signal HARQ_PATTERN_SEL Value */
#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_VAL_HARQPATTERNSELREG(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_VAL_HARQPATTERNSELREG_SHIFT)) & BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_VAL_HARQPATTERNSELREG_MASK)

#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_VAL_MWSINACTMSGREG_MASK (0x1F00U)
#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_VAL_MWSINACTMSGREG_SHIFT (8U)
/*! mwsInactMsgReg - MWS Coex Signal MWS_INACT_MSG Value */
#define BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_VAL_MWSINACTMSGREG(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_VAL_MWSINACTMSGREG_SHIFT)) & BTU2_REG_BTU_PTA_HARQ_PATTERN_SEL_VAL_MWSINACTMSGREG_MASK)
/*! @} */

/*! @name BTU_PTA_INFO_DELAY_TIMER - PTA Info Delay Timer */
/*! @{ */

#define BTU2_REG_BTU_PTA_INFO_DELAY_TIMER_PTA_INFO_DELAY_MASK (0x7U)
#define BTU2_REG_BTU_PTA_INFO_DELAY_TIMER_PTA_INFO_DELAY_SHIFT (0U)
/*! pta_info_delay - Bluetooth Sniff Interval */
#define BTU2_REG_BTU_PTA_INFO_DELAY_TIMER_PTA_INFO_DELAY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_INFO_DELAY_TIMER_PTA_INFO_DELAY_SHIFT)) & BTU2_REG_BTU_PTA_INFO_DELAY_TIMER_PTA_INFO_DELAY_MASK)
/*! @} */

/*! @name BTU_PTA_BLE_SYNC_CTRL - PTA BLE Sync Control */
/*! @{ */

#define BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_PRIORITY_MASK (0x3U)
#define BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_PRIORITY_SHIFT (0U)
/*! ble_sync_priority - BLE Sync Priority */
#define BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_PRIORITY(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_PRIORITY_SHIFT)) & BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_PRIORITY_MASK)

#define BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_DIR_MASK (0x4U)
#define BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_DIR_SHIFT (2U)
/*! ble_sync_dir - BLE Sync Direction
 *  0b0..Rx first
 *  0b1..Tx first
 */
#define BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_DIR(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_DIR_SHIFT)) & BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_DIR_MASK)

#define BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_FRAME_FW_VAL_MASK (0x8U)
#define BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_FRAME_FW_VAL_SHIFT (3U)
/*! ble_sync_frame_fw_val - BLE Sync Frame Firmware Value */
#define BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_FRAME_FW_VAL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_FRAME_FW_VAL_SHIFT)) & BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_FRAME_FW_VAL_MASK)

#define BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_FRAME_EXTEND_MASK (0x10U)
#define BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_FRAME_EXTEND_SHIFT (4U)
/*! ble_sync_frame_extend - BLE Sync Frame Extend
 *  0b0..sync_frame value will be de-asserted at falling edge of bt_req
 *  0b1..sync_frame value will be extended
 */
#define BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_FRAME_EXTEND(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_FRAME_EXTEND_SHIFT)) & BTU2_REG_BTU_PTA_BLE_SYNC_CTRL_BLE_SYNC_FRAME_EXTEND_MASK)
/*! @} */

/*! @name BTU_PTA_SYNC_CTRL - PTA Voice/WLAN Sync Control */
/*! @{ */

#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_PRIORITY_FW_VAL_MASK (0x3U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_PRIORITY_FW_VAL_SHIFT (0U)
/*! sync_priority_fw_val - Sync Priority */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_PRIORITY_FW_VAL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_PRIORITY_FW_VAL_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_PRIORITY_FW_VAL_MASK)

#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_DIR_FW_VAL_MASK (0x4U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_DIR_FW_VAL_SHIFT (2U)
/*! sync_dir_fw_val - Sync Direction
 *  0b0..Rx first
 *  0b1..Tx first
 */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_DIR_FW_VAL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_DIR_FW_VAL_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_DIR_FW_VAL_MASK)

#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_MODE_EN_MASK (0x8U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_MODE_EN_SHIFT (3U)
/*! sync_mode_en - Sync Mode Enable */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_MODE_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_MODE_EN_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_MODE_EN_MASK)

#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FS_EN_MASK (0x10U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FS_EN_SHIFT (4U)
/*! sync_fs_en - Sync Frame Scheduler Enable */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FS_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FS_EN_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FS_EN_MASK)

#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FRAME_FW_EN_MASK (0x20U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FRAME_FW_EN_SHIFT (5U)
/*! sync_frame_fw_en - Sync Frame Firmware Enable */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FRAME_FW_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FRAME_FW_EN_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FRAME_FW_EN_MASK)

#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FRAME_FW_VAL_MASK (0x40U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FRAME_FW_VAL_SHIFT (6U)
/*! sync_frame_fw_val - Sync Frame Firmware Value */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FRAME_FW_VAL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FRAME_FW_VAL_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_FRAME_FW_VAL_MASK)

#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_SCO_EN_MASK (0x80U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_SCO_EN_SHIFT (7U)
/*! sync_sco_en - Sync SCO Enable */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_SCO_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_SCO_EN_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_SCO_EN_MASK)

#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_INST_EN_MASK (0x100U)
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_INST_EN_SHIFT (8U)
/*! sync_esco_inst_en - Sync eSCO Instant Enable */
#define BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_INST_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_INST_EN_SHIFT)) & BTU2_REG_BTU_PTA_SYNC_CTRL_SYNC_ESCO_INST_EN_MASK)

