zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
#define BTU2_REG_BTU_PTA_MWS_PATTERN_REFCLK_1_MWSPATTERN_REFCLK_MASK (0x3FFU)
#define BTU2_REG_BTU_PTA_MWS_PATTERN_REFCLK_1_MWSPATTERN_REFCLK_SHIFT (0U)
/*! mwsPattern_refClk - Bluetooth Reference Clock Snapshot on MWS_PATTERN Pulse Interrupt */
#define BTU2_REG_BTU_PTA_MWS_PATTERN_REFCLK_1_MWSPATTERN_REFCLK(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_PATTERN_REFCLK_1_MWSPATTERN_REFCLK_SHIFT)) & BTU2_REG_BTU_PTA_MWS_PATTERN_REFCLK_1_MWSPATTERN_REFCLK_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_PATTERN_REFPDB_CNT - Bluetooth Reference pdBitCounter Snapshot on MWS_Pattern_Real_Int Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_PATTERN_REFPDB_CNT_MWSPATTERN_PDBITCNT_MASK (0x1FFFU)
#define BTU2_REG_BTU_PTA_MWS_PATTERN_REFPDB_CNT_MWSPATTERN_PDBITCNT_SHIFT (0U)
/*! mwsPattern_pdBitCnt - Bluetooth Reference pdBitCounter Snapshot on MWS_PATTERN Pulse Interrupt */
#define BTU2_REG_BTU_PTA_MWS_PATTERN_REFPDB_CNT_MWSPATTERN_PDBITCNT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_PATTERN_REFPDB_CNT_MWSPATTERN_PDBITCNT_SHIFT)) & BTU2_REG_BTU_PTA_MWS_PATTERN_REFPDB_CNT_MWSPATTERN_PDBITCNT_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_PATTERN_VAL - MWS Coex Signal MWS_PATTERN Value */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_PATTERN_VAL_MWSPATTERNREG_MASK (0x3U)
#define BTU2_REG_BTU_PTA_MWS_PATTERN_VAL_MWSPATTERNREG_SHIFT (0U)
/*! mwsPatternReg - MWS Coex Signal MWS_PATTERN Value */
#define BTU2_REG_BTU_PTA_MWS_PATTERN_VAL_MWSPATTERNREG(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_PATTERN_VAL_MWSPATTERNREG_SHIFT)) & BTU2_REG_BTU_PTA_MWS_PATTERN_VAL_MWSPATTERNREG_MASK)

#define BTU2_REG_BTU_PTA_MWS_PATTERN_VAL_MWSSCANFREQREG_MASK (0x1F00U)
#define BTU2_REG_BTU_PTA_MWS_PATTERN_VAL_MWSSCANFREQREG_SHIFT (8U)
/*! mwsScanFreqReg - MWS Coex Signal MWS_SCAN_FREQUENCY Value */
#define BTU2_REG_BTU_PTA_MWS_PATTERN_VAL_MWSSCANFREQREG(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_PATTERN_VAL_MWSSCANFREQREG_SHIFT)) & BTU2_REG_BTU_PTA_MWS_PATTERN_VAL_MWSSCANFREQREG_MASK)
/*! @} */

/*! @name BTU_PTA_3DG_CLK_UPDATE_REFCLK_0 - Bluetooth Reference Clock Snapshot on BT_3DG_CLK_UPATE Pulse Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFCLK_0_BT3DGCLKUPDATE_REFCLK_MASK (0xFFFFU)
#define BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFCLK_0_BT3DGCLKUPDATE_REFCLK_SHIFT (0U)
/*! BT3dgClkUpdate_refClk - Bluetooth Reference Clock Snapshot on 3D-Glass Clock Update Pulse Interrupt */
#define BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFCLK_0_BT3DGCLKUPDATE_REFCLK(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFCLK_0_BT3DGCLKUPDATE_REFCLK_SHIFT)) & BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFCLK_0_BT3DGCLKUPDATE_REFCLK_MASK)
/*! @} */

/*! @name BTU_PTA_3DG_CLK_UPDATE_REFCLK_1 - Bluetooth Reference Clock Snapshot on BT_3DG_CLK_UPATE Pulse Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFCLK_1_BT3DGCLKUPDATE_REFCLK_MASK (0x3FFU)
#define BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFCLK_1_BT3DGCLKUPDATE_REFCLK_SHIFT (0U)
/*! BT3dgClkUpdate_refClk - Bluetooth Reference Clock Snapshot on 3D-Glass Clock Update Pulse Interrupt */
#define BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFCLK_1_BT3DGCLKUPDATE_REFCLK(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFCLK_1_BT3DGCLKUPDATE_REFCLK_SHIFT)) & BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFCLK_1_BT3DGCLKUPDATE_REFCLK_MASK)
/*! @} */

/*! @name BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT - Bluetooth Reference pdBitCounter Snapshot on BT_3DG_CLK_UPDATE Pulse Interrupt */
/*! @{ */

#define BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT_BT3DGCLKUPDATE_PDBITCNT_MASK (0x1FFFU)
#define BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT_BT3DGCLKUPDATE_PDBITCNT_SHIFT (0U)
/*! BT3dgClkUpdate_pdBitCnt - Bluetooth Reference pdBitCounter Snapshot on 3D-Glass Clock Update Pulse Interrupt */
#define BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT_BT3DGCLKUPDATE_PDBITCNT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT_BT3DGCLKUPDATE_PDBITCNT_SHIFT)) & BTU2_REG_BTU_PTA_3DG_CLK_UPDATE_REFPDB_CNT_BT3DGCLKUPDATE_PDBITCNT_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4 - MWS Scan Frequency Overlap Range 1~4 */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_1_MASK (0xFU)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_1_SHIFT (0U)
/*! mws_scan_ovlp_range_1 - MWS scan frequency overlap range 1 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_1(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_1_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_1_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_2_MASK (0xF0U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_2_SHIFT (4U)
/*! mws_scan_ovlp_range_2 - MWS scan frequency overlap range 2 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_2(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_2_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_2_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_3_MASK (0xF00U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_3_SHIFT (8U)
/*! mws_scan_ovlp_range_3 - MWS scan frequency overlap range 3 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_3(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_3_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_3_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_4_MASK (0xF000U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_4_SHIFT (12U)
/*! mws_scan_ovlp_range_4 - MWS scan frequency overlap range 4 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_4(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_4_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_1_4_MWS_SCAN_OVLP_RANGE_4_MASK)
/*! @} */

