zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8 - MWS Scan Frequency Overlap Range 5~8 */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_5_MASK (0xFU)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_5_SHIFT (0U)
/*! mws_scan_ovlp_range_5 - MWS scan frequency overlap range 5 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_5(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_5_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_5_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_6_MASK (0xF0U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_6_SHIFT (4U)
/*! mws_scan_ovlp_range_6 - MWS scan frequency overlap range 6 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_6(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_6_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_6_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_7_MASK (0xF00U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_7_SHIFT (8U)
/*! mws_scan_ovlp_range_7 - MWS scan frequency overlap range 7 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_7(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_7_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_7_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_8_MASK (0xF000U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_8_SHIFT (12U)
/*! mws_scan_ovlp_range_8 - MWS scan frequency overlap range 8 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_8(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_8_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_5_8_MWS_SCAN_OVLP_RANGE_8_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12 - MWS Scan Frequency Overlap Range 9~12 */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_9_MASK (0xFU)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_9_SHIFT (0U)
/*! mws_scan_ovlp_range_9 - MWS scan frequency overlap range 9 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_9(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_9_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_9_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_10_MASK (0xF0U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_10_SHIFT (4U)
/*! mws_scan_ovlp_range_10 - MWS scan frequency overlap range 10 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_10(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_10_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_10_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_11_MASK (0xF00U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_11_SHIFT (8U)
/*! mws_scan_ovlp_range_11 - MWS scan frequency overlap range 11 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_11(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_11_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_11_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_12_MASK (0xF000U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_12_SHIFT (12U)
/*! mws_scan_ovlp_range_12 - MWS scan frequency overlap range 12 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_12(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_12_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_9_12_MWS_SCAN_OVLP_RANGE_12_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16 - MWS Scan Frequency Overlap Range 13~16 */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_13_MASK (0xFU)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_13_SHIFT (0U)
/*! mws_scan_ovlp_range_13 - MWS scan frequency overlap range 13 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_13(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_13_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_13_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_14_MASK (0xF0U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_14_SHIFT (4U)
/*! mws_scan_ovlp_range_14 - MWS scan frequency overlap range 14 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_14(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_14_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_14_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_15_MASK (0xF00U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_15_SHIFT (8U)
/*! mws_scan_ovlp_range_15 - MWS scan frequency overlap range 15 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_15(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_15_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_15_MASK)

#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_16_MASK (0xF000U)
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_16_SHIFT (12U)
/*! mws_scan_ovlp_range_16 - MWS scan frequency overlap range 16 */
#define BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_16(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_16_SHIFT)) & BTU2_REG_BTU_PTA_MWS_SCAN_OVLP_RANGE_13_16_MWS_SCAN_OVLP_RANGE_16_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_SCAN_OVLP_RANGE_17_20 - MWS Scan Frequency Overlap Range 17~20 */
/*! @{ */

