zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_INQ_RESP_MASK (0x8U)
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_INQ_RESP_SHIFT (3U)
/*! bt_rx_pri_inq_resp - BT_RX_PRI assertion during inquiry response */
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_INQ_RESP(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_INQ_RESP_SHIFT)) & BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_INQ_RESP_MASK)

#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_SLV_MASK (0x10U)
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_SLV_SHIFT (4U)
/*! bt_rx_pri_page_resp_slv - BT_RX_PRI assertion during page response at slave side */
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_SLV(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_SLV_SHIFT)) & BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_SLV_MASK)

#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_MST_TM_SEL_MASK (0x20U)
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_MST_TM_SEL_SHIFT (5U)
/*! bt_rx_pri_mst_tm_sel - BT_RX_PRI advance timing selection in Real Time mode for Bluetooth master mode
 *  0b0..select 100us range (BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifRx rising edge of the Rx packet)
 *  0b1..select 600us range (BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifTx
 *       rising edge of the preceding Tx packet)
 */
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_MST_TM_SEL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_MST_TM_SEL_SHIFT)) & BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_MST_TM_SEL_MASK)

#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_TM_SEL_MASK (0x40U)
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_TM_SEL_SHIFT (6U)
/*! bt_rx_pri_page_resp_tm_sel - BT_RX_PRI advance timing selection during master or slave page response
 *  0b0..select 100us range. For master, BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST
 *       from rifRx rising edge of each Rx ID packet. For slave, BT_RX_PRI assertion is delayed by
 *       BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV from rifRx rising edge of the Rx FHS packet.
 *  0b1..select 600us range. For master, BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST
 *       from rifTx rising edge of the first Tx ID packet. For slave, BT_RX_PRI assertion is delayed by
 *       BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV from correlation hit of the first or second Rx ID packet.
 */
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_TM_SEL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_TM_SEL_SHIFT)) & BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_PAGE_RESP_TM_SEL_MASK)

#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_INQ_RESP_TM_SEL_MASK (0x80U)
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_INQ_RESP_TM_SEL_SHIFT (7U)
/*! bt_rx_pri_inq_resp_tm_sel - BT_RX_PRI advance timing selection during inquiry response
 *  0b0..select 100us range. BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifRx rising edge of the FHS packet.
 *  0b1..select 600us range. BT_RX_PRI assertion is delayed by BTU_PTA_MWS_COEX_BT_RX_PRI_START_MST from rifTx rising edge of the first Tx ID packet.
 */
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_INQ_RESP_TM_SEL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_INQ_RESP_TM_SEL_SHIFT)) & BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_INQ_RESP_TM_SEL_MASK)

#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_EARLY_BT_RX_PRI_DEASS_FRAM_CNT_MASK (0x700U)
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_EARLY_BT_RX_PRI_DEASS_FRAM_CNT_SHIFT (8U)
/*! early_bt_rx_pri_deass_fram_cnt - Number of frames BT_RX_PRI should be de-asserted */
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_EARLY_BT_RX_PRI_DEASS_FRAM_CNT(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_EARLY_BT_RX_PRI_DEASS_FRAM_CNT_SHIFT)) & BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_EARLY_BT_RX_PRI_DEASS_FRAM_CNT_MASK)

#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_DRIVE_MASK (0x800U)
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_DRIVE_SHIFT (11U)
/*! bt_rx_pri_drive - Control BT_RX_PRI logic level directly */
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_DRIVE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_DRIVE_SHIFT)) & BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_DRIVE_MASK)

#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_ASSRT_LVL_MASK (0x3000U)
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_ASSRT_LVL_SHIFT (12U)
/*! bt_rx_pri_assrt_lvl - Specify priority level to assert BT_RX_PRI for BR/EDR packet */
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_ASSRT_LVL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_ASSRT_LVL_SHIFT)) & BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BT_RX_PRI_ASSRT_LVL_MASK)

#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BLE_RX_PRI_ASSRT_LVL_MASK (0xC000U)
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BLE_RX_PRI_ASSRT_LVL_SHIFT (14U)
/*! ble_rx_pri_assrt_lvl - Specify priority level to assert BT_RX_PRI for BLE packet */
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BLE_RX_PRI_ASSRT_LVL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BLE_RX_PRI_ASSRT_LVL_SHIFT)) & BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_CTRL_BLE_RX_PRI_ASSRT_LVL_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST - MWS Coex Early BT_RX_PRI Start Offset for Master Mode */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST_STARTOFFSETMST_MASK (0x1FFFU)
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST_STARTOFFSETMST_SHIFT (0U)
/*! StartOffsetMst - Start Offset in Master Mode */
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST_STARTOFFSETMST(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST_STARTOFFSETMST_SHIFT)) & BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_MST_STARTOFFSETMST_MASK)
/*! @} */

