zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
/*! @name BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV - MWS Coex Early BT_RX_PRI Start Offset for Slave Mode */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV_STARTOFFSETSLV_MASK (0x1FFFU)
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV_STARTOFFSETSLV_SHIFT (0U)
/*! StartOffsetSlv - Start Offset in Slave Mode */
#define BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV_STARTOFFSETSLV(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV_STARTOFFSETSLV_SHIFT)) & BTU2_REG_BTU_PTA_MWS_EARLY_BT_RX_PRI_STAROFFST_SLV_STARTOFFSETSLV_MASK)
/*! @} */

/*! @name BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV - MWS Coex Signal BT_RX_PRI Start Timer for Slave Mode */
/*! @{ */

#define BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV_BTRXPRISTARTSLVREG_MASK (0xFFFU)
#define BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV_BTRXPRISTARTSLVREG_SHIFT (0U)
/*! btRxPriStartSlvReg - BT_RX_PRI Start Timer for Slave Mode */
#define BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV_BTRXPRISTARTSLVREG(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV_BTRXPRISTARTSLVREG_SHIFT)) & BTU2_REG_BTU_PTA_MWS_COEX_BT_RX_PRI_START_SLV_BTRXPRISTARTSLVREG_MASK)
/*! @} */

/*! @name BTU_PTA_ANT_SWITCH_CTRL - PTA Antenna Switch Control */
/*! @{ */

#define BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_ANT_SWITCH_STS_BYPASS_EN_MASK (0x1U)
#define BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_ANT_SWITCH_STS_BYPASS_EN_SHIFT (0U)
/*! bca_ant_switch_sts_bypass_en - BCA antenna switch status bypass enable
 *  0b0..disable antSwitchStatus bypass
 *  0b1..enable antSwitchStatus bypass
 */
#define BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_ANT_SWITCH_STS_BYPASS_EN(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_ANT_SWITCH_STS_BYPASS_EN_SHIFT)) & BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_ANT_SWITCH_STS_BYPASS_EN_MASK)

#define BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_ANT_SWITCH_STS_BYPASS_VAL_MASK (0x2U)
#define BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_ANT_SWITCH_STS_BYPASS_VAL_SHIFT (1U)
/*! bca_ant_switch_sts_bypass_val - BCA antenna switch status bypass value
 *  0b0..set BCA antSwitchStatus to zero
 *  0b1..set BCA antSwitchStatus to one
 */
#define BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_ANT_SWITCH_STS_BYPASS_VAL(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_ANT_SWITCH_STS_BYPASS_VAL_SHIFT)) & BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_ANT_SWITCH_STS_BYPASS_VAL_MASK)

#define BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_REF_ANTENNA_MASK (0x1F00U)
#define BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_REF_ANTENNA_SHIFT (8U)
/*! bca_ref_antenna - BCA reference antenna override value */
#define BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_REF_ANTENNA(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_REF_ANTENNA_SHIFT)) & BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_REF_ANTENNA_MASK)

#define BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_REF_ANTENNA_OVERRIDE_MASK (0x8000U)
#define BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_REF_ANTENNA_OVERRIDE_SHIFT (15U)
/*! bca_ref_antenna_override - BCA reference antenna override
 *  0b0..disable BCA refAntenna override
 *  0b1..enable BCA refAntenna override
 */
#define BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_REF_ANTENNA_OVERRIDE(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_REF_ANTENNA_OVERRIDE_SHIFT)) & BTU2_REG_BTU_PTA_ANT_SWITCH_CTRL_BCA_REF_ANTENNA_OVERRIDE_MASK)
/*! @} */

/*! @name BTU_PTA_SEL_BCA_PRI_HIGH - PTA High Priority Select for BCA Arbitration */
/*! @{ */

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_MSSWITCHPRI_MASK (0x1U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_MSSWITCHPRI_SHIFT (0U)
/*! msSwitchPri - Master / Slave Switch */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_MSSWITCHPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_MSSWITCHPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_MSSWITCHPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_PAGEPRI_MASK (0x2U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_PAGEPRI_SHIFT (1U)
/*! pagePri - Page */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_PAGEPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_PAGEPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_PAGEPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_PSCANPRI_MASK (0x4U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_PSCANPRI_SHIFT (2U)
/*! pScanPri - Page Scan */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_PSCANPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_PSCANPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_PSCANPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_INQPRI_MASK (0x8U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_INQPRI_SHIFT (3U)
/*! inqPri - Inquiry */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_INQPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_INQPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_INQPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ISCANPRI_MASK (0x10U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ISCANPRI_SHIFT (4U)
/*! iScanPri - Inquiry Scan */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ISCANPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ISCANPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ISCANPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_LLRINITTXPRI_MASK (0x20U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_LLRINITTXPRI_SHIFT (5U)
/*! llrInitTxPri - LLR Initiator Tx priority */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_LLRINITTXPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_LLRINITTXPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_LLRINITTXPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_LLRINITRXPRI_MASK (0x40U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_LLRINITRXPRI_SHIFT (6U)
/*! llrInitRxPri - LLR Initiator Rx priority */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_LLRINITRXPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_LLRINITRXPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_LLRINITRXPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ESCOINSTPRI_MASK (0x80U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ESCOINSTPRI_SHIFT (7U)
/*! eScoInstPri - eSCO Instant */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ESCOINSTPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ESCOINSTPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ESCOINSTPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ESCORETRPRI_MASK (0x100U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ESCORETRPRI_SHIFT (8U)
/*! eScoRetrPri - eSCO Retransmission */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ESCORETRPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ESCORETRPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ESCORETRPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_SCOPRI_MASK (0x200U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_SCOPRI_SHIFT (9U)
/*! scoPri - SCO */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_SCOPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_SCOPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_SCOPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_BROADCASTPRI_MASK (0x400U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_BROADCASTPRI_SHIFT (10U)
/*! broadcastPri - Broadcast */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_BROADCASTPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_BROADCASTPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_BROADCASTPRI_MASK)

