zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ACLPRI_MASK (0x800U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ACLPRI_SHIFT (11U)
/*! aclPri - ACL */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ACLPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ACLPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_ACLPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_IRESPPRI_MASK (0x1000U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_IRESPPRI_SHIFT (12U)
/*! iRespPri - Inquiry Response */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_IRESPPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_IRESPPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_IRESPPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_SLVRESPPRI_MASK (0x2000U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_SLVRESPPRI_SHIFT (13U)
/*! slvRespPri - Slave Page Response */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_SLVRESPPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_SLVRESPPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_SLVRESPPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_POLLPRI_MASK (0x4000U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_POLLPRI_SHIFT (14U)
/*! pollPri - Poll packet */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_POLLPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_POLLPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_POLLPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_MSTRRESPPRI_MASK (0x8000U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_MSTRRESPPRI_SHIFT (15U)
/*! mstrRespPri - Master Page Response */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_MSTRRESPPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_MSTRRESPPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_HIGH_MSTRRESPPRI_MASK)
/*! @} */

/*! @name BTU_PTA_SEL_BCA_PRI_MED - PTA Medium Priority Select for BCA Arbitration */
/*! @{ */

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_MSSWITCHPRI_MASK (0x1U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_MSSWITCHPRI_SHIFT (0U)
/*! msSwitchPri - Master / Slave Switch */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_MSSWITCHPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_MSSWITCHPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_MSSWITCHPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_PAGEPRI_MASK (0x2U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_PAGEPRI_SHIFT (1U)
/*! pagePri - Page */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_PAGEPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_PAGEPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_PAGEPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_PSCANPRI_MASK (0x4U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_PSCANPRI_SHIFT (2U)
/*! pScanPri - Page Scan */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_PSCANPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_PSCANPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_PSCANPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_INQPRI_MASK (0x8U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_INQPRI_SHIFT (3U)
/*! inqPri - Inquiry */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_INQPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_INQPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_INQPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ISCANPRI_MASK (0x10U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ISCANPRI_SHIFT (4U)
/*! iScanPri - Inquiry Scan */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ISCANPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ISCANPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ISCANPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_LLRINITTXPRI_MASK (0x20U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_LLRINITTXPRI_SHIFT (5U)
/*! llrInitTxPri - LLR Initiator Tx priority */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_LLRINITTXPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_LLRINITTXPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_LLRINITTXPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_LLRINITRXPRI_MASK (0x40U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_LLRINITRXPRI_SHIFT (6U)
/*! llrInitRxPri - LLR Initiator Rx priority */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_LLRINITRXPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_LLRINITRXPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_LLRINITRXPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ESCOINSTPRI_MASK (0x80U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ESCOINSTPRI_SHIFT (7U)
/*! eScoInstPri - eSCO Instant */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ESCOINSTPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ESCOINSTPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ESCOINSTPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ESCORETRPRI_MASK (0x100U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ESCORETRPRI_SHIFT (8U)
/*! eScoRetrPri - eSCO Retransmission */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ESCORETRPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ESCORETRPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ESCORETRPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_SCOPRI_MASK (0x200U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_SCOPRI_SHIFT (9U)
/*! scoPri - SCO */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_SCOPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_SCOPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_SCOPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_BROADCASTPRI_MASK (0x400U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_BROADCASTPRI_SHIFT (10U)
/*! broadcastPri - Broadcast */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_BROADCASTPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_BROADCASTPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_BROADCASTPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ACLPRI_MASK (0x800U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ACLPRI_SHIFT (11U)
/*! aclPri - ACL */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ACLPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ACLPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_ACLPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_IRESPPRI_MASK (0x1000U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_IRESPPRI_SHIFT (12U)
/*! iRespPri - Inquiry Response */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_IRESPPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_IRESPPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_IRESPPRI_MASK)

