zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_BTU2_REG.h
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_SLVRESPPRI_MASK (0x2000U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_SLVRESPPRI_SHIFT (13U)
/*! slvRespPri - Slave Page Response */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_SLVRESPPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_SLVRESPPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_SLVRESPPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_POLLPRI_MASK (0x4000U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_POLLPRI_SHIFT (14U)
/*! pollPri - Poll packet */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_POLLPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_POLLPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_POLLPRI_MASK)

#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_MSTRRESPPRI_MASK (0x8000U)
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_MSTRRESPPRI_SHIFT (15U)
/*! mstrRespPri - Master Page Response */
#define BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_MSTRRESPPRI(x) (((uint16_t)(((uint16_t)(x)) << BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_MSTRRESPPRI_SHIFT)) & BTU2_REG_BTU_PTA_SEL_BCA_PRI_MED_MSTRRESPPRI_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group BTU2_REG_Register_Masks */


/*!
 * @}
 */ /* end of group BTU2_REG_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_BTU2_REG_H_ */

